       01  ARQ-CLIENTE-REG.
           03 COD-CLIENTE         PIC  9(007).
           03 CNPJ                PIC  9(014).
           03 RAZAO-SOCIAL        PIC  X(040).
           03 LATITUDE-CLIENTE    PIC S9(003)V9(008).
           03 LONGITUDE-CLIENTE   PIC S9(003)V9(008).

