       01  ARQ-DISTRIBUICAO-REG.
           03 D-COD-VENDEDOR         PIC  9(003).
           03 D-COD-CLIENTE          PIC  9(007).
           03 DISTANCIA              PIC  9(009)V9(002).

