       PROGRAM-ID.   REPORTDISTRIBUICAO as "REPORTDISTRIBUICAO".
       AUTHOR.       FRANCISCO.
       DATE-WRITTEN. 21/03/2019.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQ-VENDEDOR  ASSIGN TO DISK
                  ORGANIZATION  IS INDEXED
                  ACCESS MODE   IS DYNAMIC
                  RECORD  KEY   IS COD-VENDEDOR
                  ALTERNATE RECORD KEY IS CPF
                  LOCK MODE     IS MANUAL
                  FILE STATUS   IS WV-FILE-STATUS.

           SELECT ARQ-CLIENTE   ASSIGN TO DISK
                  ORGANIZATION  IS INDEXED
                  ACCESS MODE   IS DYNAMIC
                  RECORD  KEY   IS COD-CLIENTE
                  ALTERNATE RECORD KEY IS CNPJ
                  LOCK MODE     IS MANUAL
                  FILE STATUS   IS WC-FILE-STATUS.

           SELECT ARQ-DISTRIBUICAO ASSIGN TO DISK
                  ORGANIZATION     IS LINE SEQUENTIAL
                  ACCESS MODE      IS SEQUENTIAL
                  FILE STATUS      IS WD-FILE-STATUS.

           SELECT REL-DISTRIBUICAO ASSIGN TO "relDistribuicao.csv"
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  ARQ-VENDEDOR
           LABEL RECORD IS STANDARD
           VALUE OF FILE-ID IS 'cadVendedor'.
       COPY "VENDEDOR.CPY".
       
       FD  ARQ-CLIENTE
           LABEL RECORD IS STANDARD
           VALUE OF FILE-ID IS 'cadCliente'.
       COPY "CLIENTE.CPY".
       
       FD  ARQ-DISTRIBUICAO
           LABEL RECORD IS STANDARD
           VALUE OF FILE-ID IS 'cadDistribuicao'.
       COPY "DISTRIBUICAO.CPY".

       FD  REL-DISTRIBUICAO.
       01  REL-REGISTRO PIC X(110).

       WORKING-STORAGE SECTION.
       77 WV-FILE-STATUS         PIC  X(002) VALUE "00".
       77 WC-FILE-STATUS         PIC  X(002) VALUE "00".
       77 WD-FILE-STATUS         PIC  X(002) VALUE "00".

       01  W-CAB1.
           03 FILLER PIC X(100) VALUE "RELATORIO CLIENTES X VENDEDORES".
           
       01  W-CAB2.
           03 FILLER PIC X(15) VALUE "CODIGO CLIENTE;".
           03 FILLER PIC X(21) VALUE "RAZAO SOCIAL CLIENTE;".
           03 FILLER PIC X(16) VALUES "CODIGO VENDEDOR;".
           03 FILLER PIC X(29) VALUES "DISTANCIA CLIENTE X VENDEDOR;".

       01  W-DET1.
           03 W-DET-CODIGO-CLIENTE  PIC 9(007) VALUE ZEROS.
           03 FILLER                PIC X(001) VALUE ";".
           03 W-DET-RAZAO-SOCIAL    PIC X(040) VALUE SPACES.
           03 FILLER                PIC X(001) VALUE ";".
           03 W-DET-CODIGO-VENDEDOR PIC 9(003) VALUE ZEROS.
           03 FILLER                PIC X(001) VALUE ";".
           03 W-DET-NOME-VENDEDOR   PIC X(040) VALUE SPACES.
           03 FILLER                PIC X(001) VALUE ";".
           03 W-DET-DISTANCIA       PIC ZZZZZZZZ9,99 VALUE ZEROS.
           03 FILLER                PIC X(001) VALUE ";".

       PROCEDURE DIVISION.
       000-INCIIO.
           OPEN INPUT  ARQ-CLIENTE
           OPEN INPUT  ARQ-VENDEDOR
           OPEN INPUT  ARQ-DISTRIBUICAO
           OPEN OUTPUT REL-DISTRIBUICAO
           
           READ ARQ-DISTRIBUICAO
           IF WD-FILE-STATUS EQUAL TO "00"
              WRITE REL-REGISTRO FROM W-CAB1 AFTER 1 LINE
              WRITE REL-REGISTRO FROM W-CAB2 AFTER 1 LINE
           END-IF
           
           PERFORM 100-IMPRIMIR-RELATORIO UNTIL WD-FILE-STATUS          
               NOT EQUAL "00"

           CLOSE ARQ-CLIENTE
           CLOSE ARQ-VENDEDOR
           CLOSE ARQ-DISTRIBUICAO
           CLOSE REL-DISTRIBUICAO

           CALL  "MENU".

       100-IMPRIMIR-RELATORIO.
           MOVE D-COD-CLIENTE  TO COD-CLIENTE
           READ ARQ-CLIENTE RECORD KEY IS COD-CLIENTE
           
           MOVE COD-CLIENTE    TO W-DET-CODIGO-CLIENTE
           MOVE RAZAO-SOCIAL   TO W-DET-RAZAO-SOCIAL
       
           MOVE D-COD-VENDEDOR TO COD-VENDEDOR
           READ ARQ-VENDEDOR RECORD KEY IS COD-VENDEDOR

           MOVE COD-VENDEDOR   TO W-DET-CODIGO-VENDEDOR
           MOVE NOME-VENDEDOR  TO W-DET-NOME-VENDEDOR   
           MOVE DISTANCIA      TO W-DET-DISTANCIA
           
           WRITE REL-REGISTRO FROM W-DET1 AFTER 1 LINE
           READ ARQ-DISTRIBUICAO.
       
       END PROGRAM REPORTDISTRIBUICAO.