       01  ARQ-VENDEDOR-REG.
           03 COD-VENDEDOR         PIC  9(003).
           03 CPF                  PIC  9(011).
           03 NOME-VENDEDOR        PIC  X(040).
           03 LATITUDE-VENDEDOR    PIC S9(003)V9(008).
           03 LONGITUDE-VENDEDOR   PIC S9(003)V9(008).